## Pandas

In [5]:
import pandas as pd
import csv

with open('data/employee.csv') as f:
    reader = csv.reader(f)
    header = next(reader)
    data = list(reader)
    print(data)

FileNotFoundError: [Errno 2] No such file or directory: 'data/employee.csv'

In [16]:
gender = [row[6] for row in data]

NameError: name 'data' is not defined

In [17]:
from collections import Counter

nums = Counter(gender)
nums

NameError: name 'gender' is not defined

In [7]:
set([row[2] for row in data])

{'Admn. & Regulatory Affairs',
 "City Controller's Office",
 'City Council',
 'Convention and Entertainment',
 'Dept of Neighborhoods (DON)',
 'Finance',
 'Fleet Management Department',
 'General Services Department',
 'Health & Human Services',
 'Housing and Community Devp.',
 'Houston Airport System (HAS)',
 'Houston Emergency Center (HEC)',
 'Houston Fire Department (HFD)',
 'Houston Information Tech Svcs',
 'Houston Police Department-HPD',
 'Human Resources Dept.',
 'Legal Department',
 'Library',
 "Mayor's Office",
 'Municipal Courts Department',
 'Parks & Recreation',
 'Planning & Development',
 'Public Works & Engineering-PWE',
 'Solid Waste Management'}

- `Series`
- `DataFrame`

In [2]:
import pandas as pd

CSV

In [ ]:
df = pd.read_csv('data/employee.csv')
type(df)

NameError: name 'pd' is not defined

In [7]:
df

NameError: name 'df' is not defined

JSON

In [5]:
df_iris = pd.read_json('data/iris.json')
df_iris.head()

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [6]:
type(df_iris)

pandas.core.frame.DataFrame

Excel

In [10]:
df_titanic = pd.read_excel('data/titanic.xlsx', sheet_name='Sheet1')

In [11]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

HTML

```bash
pip install lxml
```

In [5]:
df_countries_list = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_area')

NameError: name 'pd' is not defined

In [ ]:
type(df_countries_list)

NameError: name 'df_countries_list' is not defined

In [16]:
len(df_countries_list)

4

In [19]:
df_countries = df_countries_list[1]

In [20]:
type(df_countries)

pandas.core.frame.DataFrame

Parquet

```bash
pip install pyarrow
pip install   fastparquet
```

In [21]:
flights = pd.read_parquet('data/flights')

TODO
```python
flights.to_csv('flights.csv', index=False)
```

Sqlite

In [22]:
import sqlite3

with sqlite3.connect('data/chinook.db') as connection:
    df_employee = pd.read_sql(
        "SELECT * FROM employees",
        con=connection
    )

In [31]:
with sqlite3.connect('data/chinook.db') as connection:
    df_employee = pd.read_sql_table(
        table_name="employees",
        con=connection
    )

NotImplementedError:

In [24]:
df_employee.head(3)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com

SQL Server

```bash
pip install pyodbc
pip install SQLAlchemy
```

In [25]:
from sqlalchemy import create_engine

SERVER_NAME = 'Lenovo'
DATABASE_NAME = 'BikeStores'
DRIVER = 'ODBC+Driver+17+for+SQL+Server'
CONNECTION_STRING = f'mssql+pyodbc://{SERVER_NAME}/{DATABASE_NAME}?trusted_connection=yes&driver={DRIVER}'
print(CONNECTION_STRING)

mssql+pyodbc://Lenovo/BikeStores?trusted_connection=yes&driver=ODBC+Driver+17+for+SQL+Server

In [26]:
ms_sql_engine = create_engine(CONNECTION_STRING)

In [27]:
df_brands = pd.read_sql(
    "SELECT * FROM production.brands",
    con=ms_sql_engine
)

In [28]:
df_brands

   brand_id    brand_name
0         1       Electra
1         2          Haro
2         3        Heller
3         4   Pure Cycles
4         5       Ritchey
5         6       Strider
6         7  Sun Bicycles
7         8         Surly
8         9          Trek

In [29]:
df_categories = pd.read_sql_table(
    table_name='categories',
    schema='production',
    con=ms_sql_engine
)

In [30]:
df_categories.head()

   category_id        category_name
0            1    Children Bicycles
1            2     Comfort Bicycles
2            3    Cruisers Bicycles
3            4  Cyclocross Bicycles
4            5       Electric Bikes

Postgre SQL

```bash
pip install psycopg2
```

In [32]:
from getpass import getpass
from urllib.parse import quote_plus

host = 'localhost'
username = 'postgres'
password = quote_plus(getpass())
database = 'store'

connection_string = r'postgresql+psycopg2://{username}:{password}@{host}/{database}'
postgres_engine = create_engine(connection_string)


df_sales = pd.read_sql("select * from sales", con=postgres_engine)

In [33]:
quote_plus('nimadir yozsak @ deb')

'nimadir+yozsak+%40+deb'

In [34]:
df_sales.head()

,sale_id,sale_date,customer_id,product_id,quantity,sale_amount,discount,total_amount,created_at,updated_at
0,1,2024-11-01,1,101,2,100.0,10.0,90.0,2024-11-11 16:31:32.380639,2024-11-11 16:31:32.380639
1,2,2024-11-02,2,102,1,50.0,5.0,47.5,2024-11-11 16:31:32.380639,2024-11-11 16:31:32.380639
2,3,2024-11-03,1,103,3,30.0,0.0,30.0,2024-11-11 16:31:32.380639,2024-11-11 16:31:32.380639
3,4,2024-11-04,3,104,5,200.0,15.0,170.0,2024-11-11 16:31:32.380639,2024-11-11 16:31:32.380639
4,5,2024-11-05,4,105,2,120.0,20.0,96.0,2024-11-11 16:31:32.380639,2024-11-11 16:31:32.380639

Convert from `list` and `dict`

In [39]:
data = [
    ['John', 'Doe', 40],
    ['Jone', 'Doe', 44],
    ['Adam', 'Smith', 40],
]

columns = ['FirstName', 'LastName', 'Age']

df = pd.DataFrame(data=data, columns=columns)

In [40]:
df

  FirstName LastName  Age
0      John      Doe   40
1      Jone      Doe   44
2      Adam    Smith   40

**head**

In [42]:
df_iris.head()

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

**tail**

In [45]:
df_iris.tail(3)

     sepalLength  sepalWidth  petalLength  petalWidth    species
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

**sample**

In [57]:
df_iris.sample(5)

     sepalLength  sepalWidth  petalLength  petalWidth     species
136          6.3         3.4          5.6         2.4   virginica
11           4.8         3.4          1.6         0.2      setosa
97           6.2         2.9          4.3         1.3  versicolor
126          6.2         2.8          4.8         1.8   virginica
92           5.8         2.6          4.0         1.2  versicolor

**info**

In [58]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sepalLength  150 non-null    float64
 1   sepalWidth   150 non-null    float64
 2   petalLength  150 non-null    float64
 3   petalWidth   150 non-null    float64
 4   species      150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

**describe**

In [60]:
df_employee.describe()

       EmployeeId  ReportsTo
count     8.00000   7.000000
mean      4.50000   2.857143
std       2.44949   2.193063
min       1.00000   1.000000
25%       2.75000   1.500000
50%       4.50000   2.000000
75%       6.25000   4.000000
max       8.00000   6.000000

In [62]:
len(df_employee)

8

**shape**

In [63]:
df_employee.shape

(8, 15)

**dtypes**

In [64]:
df_employee.dtypes

EmployeeId      int64
LastName       object
FirstName      object
Title          object
ReportsTo     float64
BirthDate      object
HireDate       object
Address        object
City           object
State          object
Country        object
PostalCode     object
Phone          object
Fax            object
Email          object
dtype: object

**columns**

In [65]:
df_employee.columns

Index(['EmployeeId', 'LastName', 'FirstName', 'Title', 'ReportsTo',
       'BirthDate', 'HireDate', 'Address', 'City', 'State', 'Country',
       'PostalCode', 'Phone', 'Fax', 'Email'],
      dtype='object')

In [68]:
new_columns = [column.lower() for column in df_employee.columns]
new_columns

['employeeid',
 'lastname',
 'firstname',
 'title',
 'reportsto',
 'birthdate',
 'hiredate',
 'address',
 'city',
 'state',
 'country',
 'postalcode',
 'phone',
 'fax',
 'email']

In [69]:
df_employee.columns = new_columns

**index**

In [70]:
df_employee.head(5)

,employeeid,lastname,firstname,title,reportsto,birthdate,hiredate,address,city,state,country,postalcode,phone,fax,email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [71]:
df_employee.index

RangeIndex(start=0, stop=8, step=1)

In [76]:
df = pd.read_csv('data/employee.csv', index_col='UNIQUE_ID')
df.head()

,POSITION_TITLE,DEPARTMENT,BASE_SALARY,RACE,EMPLOYMENT_TYPE,GENDER,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE
UNIQUE_ID,,,,,,,,,
0,ASSISTANT DIRECTOR (EX LVL),Municipal Courts Department,121862.0,Hispanic/Latino,Full Time,Female,Active,2006-06-12,2012-10-13
1,LIBRARY ASSISTANT,Library,26125.0,Hispanic/Latino,Full Time,Female,Active,2000-07-19,2010-09-18
2,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Full Time,Male,Active,2015-02-03,2015-02-03
3,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Full Time,Male,Active,1982-02-08,1991-05-25
4,ELECTRICIAN,General Services Department,56347.0,White,Full Time,Male,Active,1989-06-19,1994-10-22

In [77]:
df.index

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999],
      dtype='int64', name='UNIQUE_ID', length=2000)

In [83]:
s = df_employee['lastname'] # returns Series

In [91]:
d = df_employee[['lastname', 'firstname', 'birthdate']] # returns Data Frame
d

   lastname firstname            birthdate
0     Adams    Andrew  1962-02-18 00:00:00
1   Edwards     Nancy  1958-12-08 00:00:00
2   Peacock      Jane  1973-08-29 00:00:00
3      Park  Margaret  1947-09-19 00:00:00
4   Johnson     Steve  1965-03-03 00:00:00
5  Mitchell   Michael  1973-07-01 00:00:00
6      King    Robert  1970-05-29 00:00:00
7  Callahan     Laura  1968-01-09 00:00:00

In [88]:
df_employee.columns

Index(['employeeid', 'lastname', 'firstname', 'title', 'reportsto',
       'birthdate', 'hiredate', 'address', 'city', 'state', 'country',
       'postalcode', 'phone', 'fax', 'email'],
      dtype='object')

In [94]:
df_iris.describe()

       sepalLength  sepalWidth  petalLength  petalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.057333     3.758000    1.199333
std       0.828066    0.435866     1.765298    0.762238
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [105]:
import numpy as np
df_iris['category'] = np.where(df_iris['sepalLength'] < 5.8, 'low', 'high')

In [109]:
df_iris.drop(columns=['new_col'], inplace=True)

In [110]:
df_iris

     sepalLength  sepalWidth  petalLength  petalWidth    species category
0            5.1         3.5          1.4         0.2     setosa      low
1            4.9         3.0          1.4         0.2     setosa      low
2            4.7         3.2          1.3         0.2     setosa      low
3            4.6         3.1          1.5         0.2     setosa      low
4            5.0         3.6          1.4         0.2     setosa      low
..           ...         ...          ...         ...        ...      ...
145          6.7         3.0          5.2         2.3  virginica     high
146          6.3         2.5          5.0         1.9  virginica     high
147          6.5         3.0          5.2         2.0  virginica     high
148          6.2         3.4          5.4         2.3  virginica     high
149          5.9         3.0          5.1         1.8  virginica     high

[150 rows x 6 columns]

In [114]:
df_iris.drop('category', axis=1)

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

In [116]:
s = df_iris['sepalLength'] < 5

In [117]:
type(s)

pandas.core.series.Series

In [118]:
s

0      False
1       True
2       True
3       True
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: sepalLength, Length: 150, dtype: bool

In [121]:
df_iris[df_iris['sepalLength'] < 5]

     sepalLength  sepalWidth  petalLength  petalWidth     species category
1            4.9         3.0          1.4         0.2      setosa      low
2            4.7         3.2          1.3         0.2      setosa      low
3            4.6         3.1          1.5         0.2      setosa      low
6            4.6         3.4          1.4         0.3      setosa      low
8            4.4         2.9          1.4         0.2      setosa      low
9            4.9         3.1          1.5         0.1      setosa      low
11           4.8         3.4          1.6         0.2      setosa      low
12           4.8         3.0          1.4         0.1      setosa      low
13           4.3         3.0          1.1         0.1      setosa      low
22           4.6         3.6          1.0         0.2      setosa      low
24           4.8         3.4          1.9         0.2      setosa      low
29           4.7         3.2          1.6         0.2      setosa      low
30           4.8         3.1          1.6         0.2      setosa      low
34           4.9         3.1          1.5         0.2      setosa      low
37           4.9         3.6          1.4         0.1      setosa      low
38           4.4         3.0          1.3         0.2      setosa      low
41           4.5         2.3          1.3         0.3      setosa      low
42           4.4         3.2          1.3         0.2      setosa      low
45           4.8         3.0          1.4         0.3      setosa      low
47           4.6         3.2          1.4         0.2      setosa      low
57           4.9         2.4          3.3         1.0  versicolor      low
106          4.9         2.5          4.5         1.7   virginica      low

In [122]:
df_iris[df_iris['sepalLength'] > 4.5]

     sepalLength  sepalWidth  petalLength  petalWidth    species category
0            5.1         3.5          1.4         0.2     setosa      low
1            4.9         3.0          1.4         0.2     setosa      low
2            4.7         3.2          1.3         0.2     setosa      low
3            4.6         3.1          1.5         0.2     setosa      low
4            5.0         3.6          1.4         0.2     setosa      low
..           ...         ...          ...         ...        ...      ...
145          6.7         3.0          5.2         2.3  virginica     high
146          6.3         2.5          5.0         1.9  virginica     high
147          6.5         3.0          5.2         2.0  virginica     high
148          6.2         3.4          5.4         2.3  virginica     high
149          5.9         3.0          5.1         1.8  virginica     high

[145 rows x 6 columns]

In [127]:
df_iris[(df_iris['sepalLength'] < 5) & (df_iris['sepalLength'] > 4.5)]

     sepalLength  sepalWidth  petalLength  petalWidth     species category
1            4.9         3.0          1.4         0.2      setosa      low
2            4.7         3.2          1.3         0.2      setosa      low
3            4.6         3.1          1.5         0.2      setosa      low
6            4.6         3.4          1.4         0.3      setosa      low
9            4.9         3.1          1.5         0.1      setosa      low
11           4.8         3.4          1.6         0.2      setosa      low
12           4.8         3.0          1.4         0.1      setosa      low
22           4.6         3.6          1.0         0.2      setosa      low
24           4.8         3.4          1.9         0.2      setosa      low
29           4.7         3.2          1.6         0.2      setosa      low
30           4.8         3.1          1.6         0.2      setosa      low
34           4.9         3.1          1.5         0.2      setosa      low
37           4.9         3.6          1.4         0.1      setosa      low
45           4.8         3.0          1.4         0.3      setosa      low
47           4.6         3.2          1.4         0.2      setosa      low
57           4.9         2.4          3.3         1.0  versicolor      low
106          4.9         2.5          4.5         1.7   virginica      low

In [129]:
df_iris.query("sepalLength < 5").head()

   sepalLength  sepalWidth  petalLength  petalWidth species category
1          4.9         3.0          1.4         0.2  setosa      low
2          4.7         3.2          1.3         0.2  setosa      low
3          4.6         3.1          1.5         0.2  setosa      low
6          4.6         3.4          1.4         0.3  setosa      low
8          4.4         2.9          1.4         0.2  setosa      low

In [133]:
df_iris['sepalLength'].sort_values(ascending=True)

13     4.3
8      4.4
42     4.4
38     4.4
41     4.5
      ...
122    7.7
117    7.7
118    7.7
135    7.7
131    7.9
Name: sepalLength, Length: 150, dtype: float64

In [137]:
df_iris.sort_values(by=['sepalWidth', 'sepalLength'])

     sepalLength  sepalWidth  petalLength  petalWidth     species category
60           5.0         2.0          3.5         1.0  versicolor      low
62           6.0         2.2          4.0         1.0  versicolor     high
119          6.0         2.2          5.0         1.5   virginica     high
68           6.2         2.2          4.5         1.5  versicolor     high
41           4.5         2.3          1.3         0.3      setosa      low
..           ...         ...          ...         ...         ...      ...
16           5.4         3.9          1.3         0.4      setosa      low
14           5.8         4.0          1.2         0.2      setosa     high
32           5.2         4.1          1.5         0.1      setosa      low
33           5.5         4.2          1.4         0.2      setosa      low
15           5.7         4.4          1.5         0.4      setosa      low

[150 rows x 6 columns]

In [143]:
df_employee['reportsto'].notnull()

0    False
1     True
2     True
3     True
4     True
5     True
6     True
7     True
Name: reportsto, dtype: bool

In [146]:
df_employee[df_employee['reportsto'].isnull()]

,employeeid,lastname,firstname,title,reportsto,birthdate,hiredate,address,city,state,country,postalcode,phone,fax,email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com

In [150]:
df_employee.isna()

,employeeid,lastname,firstname,title,reportsto,birthdate,hiredate,address,city,state,country,postalcode,phone,fax,email
0,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [151]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [157]:
df_titanic.dropna(subset=['Age']).shape

(714, 12)

In [160]:
df_titanic['Age'].sum()

np.float64(21205.17)

In [161]:
df_titanic['Age'].min()

np.float64(0.42)

In [162]:
df_titanic['Age'].max()

np.float64(80.0)

In [163]:
df_titanic['Age'].mean()

np.float64(29.69911764705882)

In [164]:
df_titanic['Age'].median()

np.float64(28.0)

In [168]:
df_titanic.select_dtypes('number').sum()

PassengerId    397386.0000
Survived          342.0000
Pclass           2057.0000
Age             21205.1700
SibSp             466.0000
Parch             340.0000
Fare            28693.9493
dtype: float64

In [169]:
df_titanic.select_dtypes('object')

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [173]:
df_titanic['Age'].fillna(0).isna().sum()

np.int64(0)